In [46]:
import pandas as pd
import os
from sqlalchemy import create_engine


user = os.getenv("ORACLE_USER")
password = os.getenv("ORACLE_PASSWORD")
host = os.getenv("ORACLE_HOST")
service = os.getenv("ORACLE_SERVICE")

connection = f"oracle+oracledb://{user}:{password}@{host}:1521/{service}"

query = "SELECT * FROM dual"

df = pd.read_sql(query, connection)
df.head()

  dummy
0     X

In [49]:
df = pd.read_sql(
'''
SELECT table_name
FROM user_tables 
WHERE table_name LIKE '%DBT%'
'''
,connection)
df.head()

     table_name
0  DBT_EMP_GOLD

In [53]:
df = pd.read_sql(
'''
select view_name 
from user_views
WHERE view_name LIKE '%DBT%'
'''
,connection)
df.head()

           view_name
0       DBT_DEPT_RAW
1            DBT_EMP
2        DBT_EMP_RAW
3     DBT_EMP_SILVER
4  DBT_SALARY_SILVER